{"userName":"shitmydadsays","userId":"62581962","tweets":[{"text":"\"No. You don't read news. You read stuff you agree with. Just because somebody's shit smells like yours, doesn't mean it's not still shit.\"","timestamp":1340386894,"mentions":[],"urls":[]},{"text":"\"No Father's day gifts. Just write me a card...Of course I'm kidding. Buy me shit, I created you.\" (New book out now: http://bit.ly/HQxDee )","timestamp":1339706481,"mentions":[],"urls":["bit.ly/HQxDee"]},{"text":"\"We ain't a sharp species. We kill each other over arguments about what happens when you die, then fail to see the fucking irony in that.\"","timestamp":1338832550,"mentions":[],"urls":[]},{"text":"\"Any idiot can get lucky once. Takes a special idiot to get lucky twice.\" New book #ISuckAtGirls out today. An excerpt: http://es.pn/IVV45i","timestamp":1337109039,"mentions":[],"urls":["es.pn/IVV45i"]},{"text":"\"No. Politicians don't wanna scare you, they wanna keep you stupid. Fear is just the smell when ignorance takes a shit.\"","timestamp":1336756802,"mentions":[],"urls":[]},{"text":"\"No. I like talking, I just hate people. If I could find other shit to talk to, I'd be all for it.\" Pre-order new book http://bit.ly/I3iuqC","timestamp":1335901715,"mentions":[],"urls":["bit.ly/I3iuqC"]},{"text":"\"No, you can be ugly and get laid. You just gotta be willing to screw someone uglier than you.\" Pre-order new book: http://bit.ly/I3iuqC","timestamp":1335294375,"mentions":[],"urls":["bit.ly/I3iuqC"]},{"text":"\"You screw without rubbers, kids happen. Sorry-you don’t get to have the dog without the dog shit.” Pre-order new book: http://bit.ly/I3iuqC","timestamp":1334685861,"mentions":[],"urls":["bit.ly/I3iuqC"]},{"text":"\"No. You don't even have hair on your balls.\" Story from my new book about asking my dad to explain sex when I was 9. http://bit.ly/isuckatgirls","timestamp":1333644287,"mentions":[],"urls":["bit.ly/isuckatgirls"]},{"text":"\"You're not going bald...No, I meant you're not GOING bald 'cause you're already fucking bald. Don't make me live in your fantasy land.\"","timestamp":1332518840,"mentions":[],"urls":[]},{"text":"\"Your favorite team doesn't give a fuck about you.\" A short story about my dad's thoughts on sports. http://www.grantland.com/story/_/id/7654198/the-writer-sh*t-my-dad-says-why-your-team-give-damn-you …","timestamp":1331139246,"mentions":[],"urls":["grantland.com/story/_/id/765"]},{"text":"\"Valentine's day is bullshit. Our DNA demands we fuck each other, so if you need a holiday to talk your wife into screwing you, it's over.\"","timestamp":1328722845,"mentions":[],"urls":[]},{"text":"\"These candidates are dog shit. All we're doing is picking out the dick that's going to fuck us.\"","timestamp":1325703401,"mentions":[],"urls":[]},{"text":"A response to my dad's question, \"What happens when they cancel a shitty TV show like yours?\" http://www.grantland.com/blog/hollywood-prospectus/post/_/id/39614/i-would-like-to-help-you-get-your-show-cancelled …","timestamp":1324406512,"mentions":[],"urls":["grantland.com/blog/hollywood"]},{"text":"My dad explains why he thinks internet comments will end the world. http://www.funnyordie.com/articles/322261cd73/why-internet-commenters-will-eventually-end-the-world?playlist=featured_pictures_and_words …","timestamp":1323111678,"mentions":[],"urls":["funnyordie.com/articles/32226"]},{"text":"\"I'm in Cincinnati at a waffle house that's across from 2 waffle houses. Everyone's fat. This city is fucking hall of fame of Diabetes.\"","timestamp":1322502889,"mentions":[],"urls":[]},{"text":"\"Bullshit. War ain't over till people stop shooting. You can't say you're done taking a crap if shit's still coming out of your ass.\"","timestamp":1319219348,"mentions":[],"urls":[]},{"text":"\"There won't be humans in 500 years. Enough people choke themselves when they jerk off we gave it a name. We ain't a species made to last.\"","timestamp":1318439561,"mentions":[],"urls":[]},{"text":"\"Bullshit. Don't pretend you don't care about your birthday. It's like watching a hooker pretend she's out for a walk when cops drive by.\"","timestamp":1316021085,"mentions":[],"urls":[]},{"text":"\"You can't come...Because it's not a vacation if my family is with me. I could vacation in my fucking house if you people left it.\"","timestamp":1313084710,"mentions":[],"urls":[]},{"text":"\"You can't come...Because it's not a vacation if my family is with me. I could vacation in my fucking house if you people left it.\"","timestamp":1313084710,"mentions":[],"urls":[]},{"text":"\"He's nice now but he WAS an asshole. Just 'cause a piece of shit dries up and stops smelling, doesn't mean it's not still a piece of shit.\"","timestamp":1311008722,"mentions":[],"urls":[]},{"text":"A short story about why my dad thinks Father's Day is bullshit. http://scr.bi/ixOHFe","timestamp":1308068656,"mentions":[],"urls":["scr.bi/ixOHFe"]},{"text":"\"You didn't get a good deal, you were just fucked gently. Trust me, Best Buy will not be the one with the sore asshole tomorrow.\"","timestamp":1305141428,"mentions":[],"urls":[]},{"text":"\"WENT through an awkward phase? What phase you think you're in now? Ever seen yourself walk up stairs? It's like a T-rex that shit himself.\"","timestamp":1302206020,"mentions":[],"urls":[]},{"text":"\"So he likes drugs and hookers. That's the mustard & mayo on the sandwich of life. Problem is, that's all he's got on his fucking sandwich.\"","timestamp":1299786423,"mentions":[],"urls":[]},{"text":"\"I just don't wanna celebrate a bullshit holiday. I'm plenty romantic. I own a home and have never shit my pants. Two things you can't say.\"","timestamp":1297706964,"mentions":[],"urls":[]},{"text":"\"No. Aliens exist, I just don't think they came millions of light years\njust to see earth. Be like driving 1000 miles to go to an Arby's\"","timestamp":1295979596,"mentions":[],"urls":[]},{"text":"\"No thanks. I don't need a party to celebrate New Year's. All I need is a bottle of bourbon and a t-shirt that hangs down passed my balls.\"","timestamp":1293831261,"mentions":[],"urls":[]},{"text":"\"Everyone thinks their opinion matters. Don't argue with a nobody. A farmer doesn't bother telling a pig his breath smells like shit.\"","timestamp":1291312234,"mentions":[],"urls":[]},{"text":"\"No. I want the salad...Live a little? I'm ordering lunch. I don't have a choice between salad or fucking skydiving.\"","timestamp":1289506940,"mentions":[],"urls":[]},{"text":"Sorry, shit my dad says got hacked. My dad isn't trying to sell you a crappy lap top, I promise. Don't open any links.","timestamp":1289360657,"mentions":[],"urls":[]},{"text":"\"He's a politician. It's like being a hooker. You can't be one unless you can pretend to like people while you're fucking them.\"","timestamp":1288287090,"mentions":[],"urls":[]},{"text":"\"You don't have to be good to succeed. You just gotta be the least shitty option. Example: We're eating at The Olive Garden.\"","timestamp":1286478464,"mentions":[],"urls":[]},{"text":"\"Nervous? In 5 billion years the sun will burn out and nothing you did will matter. Feel better?\" (Show airs tonight! 830/730c CBS)","timestamp":1285261856,"mentions":[],"urls":[]},{"text":"\"You came out of your mom looking like shit. She thought you were beautiful. Don't know what scared me most, your looks or her judgment.\"","timestamp":1284742274,"mentions":[],"urls":[]},{"text":"\"Put the rake down. I don't wanna sit around watching you 'give it your best.' Either stop sucking or get the fuck out of the way.\"","timestamp":1283187262,"mentions":[],"urls":[]},{"text":"\"See, you think I give a shit. Wrong. In fact, while you talk, I'm thinking; How can I give less of shit? That's why I look interested.\"","timestamp":1281216833,"mentions":[],"urls":[]},{"text":"\"Invite them. A wedding is a loaded gun. Don't be the asshole staring down the barrel asking which button makes the boom noise.\"","timestamp":1279556231,"mentions":[],"urls":[]},{"text":"\"Don’t focus on the one guy who hates you. You don’t go to the park and set your picnic down next to the only pile of dog shit.\"","timestamp":1277743281,"mentions":[],"urls":[]},{"text":"\"Don’t focus on the one guy who hates you. You don’t go to the park and set your picnic down next to the only pile of dog shit.\"","timestamp":1277743281,"mentions":[],"urls":[]},{"text":"\"Engagement rings are pointless. Indians gave cows...Oh sorry, congrats on proposing. We good now? Can I finish my indian story?\"","timestamp":1276788925,"mentions":[],"urls":[]},{"text":"\"Look, we're basically on earth to shit and fuck. So unless your job's to help people shit or fuck, it's not that important, so relax.\"","timestamp":1275700092,"mentions":[],"urls":[]},{"text":"\"No. Humans will die out. We're weak. Dinosaurs survived on rotten flesh. You got diarrhea last week from a Wendy's.\"","timestamp":1274901053,"mentions":[],"urls":[]},{"text":"\"They're offended? Fuck, shit, asshole, shitfuck; they're just words...Fine. Shitfuck isn't a word, but you get my point.\"","timestamp":1274486318,"mentions":[],"urls":[]},{"text":"\"I don't want your advice, you're 27 fucking years old...Fine.  I don't want your advice, you're 29 fucking years old.\"","timestamp":1273616321,"mentions":[],"urls":[]},{"text":"\"YOU, a published writer?..Internet don't count. Any asshole can throw shit up on there.\" (Book On Sale Today!) http://tinyurl.com/yc79h4l","timestamp":1272989476,"mentions":[],"urls":[]},{"text":"“You seen my cell phone?...What’s it look like? Like two horses fucking. It’s a phone, son. It looks like a phone.\"","timestamp":1272908698,"mentions":[],"urls":[]},{"text":"\"Stop trying so hard. He doesn't like you. Jesus, don't kiss an ass if it's in the process of shitting on you.\"","timestamp":1272326617,"mentions":[],"urls":[]},{"text":"“It’s Los Angeles, son. It’s the epicenter of the asshole earthquake. They’d fuck you twice if they had another dick.”","timestamp":1271804693,"mentions":[],"urls":[]},{"text":"\"I’m not sure you can call that roughing it, son… Well, for one, there was a fucking minivan parked forty feet from your sleeping bags.”","timestamp":1271439563,"mentions":[],"urls":[]},{"text":"\"Waking up when you got a baby, you feel like you drank a bottle of whiskey the night before, except the shit's in someone else's pants.\"","timestamp":1271097023,"mentions":[],"urls":[]},{"text":"\"I found some shit in your room...No, I found actual shit. Feces...Well I should hope it's from your shoes, otherwise what the fuck?\"","timestamp":1270755293,"mentions":[],"urls":[]},{"text":"\"Don't start a story with This is SO funny. Be like saying My dick's huge before you screw. Even if you're right you sound like an asshole.\"","timestamp":1270506078,"mentions":[],"urls":[]},{"text":"\"Your mom just ordered 35 copies of your book. I'm not paying for one. Fucking. Copy. Mine's free.\" http://shitmydadsays.com/book","timestamp":1270139853,"mentions":[],"urls":[]},{"text":"\"I didn't say you were ugly. I said your girlfriend is better looking than you, and standing next to her, you look ugly.\"","timestamp":1269626249,"mentions":[],"urls":[]},{"text":"\"Don't ask for my opinion then. I said congrats on the car, just saying nobody's panties are getting wet from a fucking Honda Accord.\"","timestamp":1269277580,"mentions":[],"urls":[]},{"text":"\"War hero? No. I was a doc in Vietnam. My job was to say \"This is what happens when you screw a hooker, kid. Put this cream on your pecker.\"","timestamp":1268762428,"mentions":[],"urls":[]},{"text":"\"HIDDEN roaming charges? Jesus, Sprint has 'fucking people' down to a science, like they practice it in a fucking lab on mice first.\"","timestamp":1268260883,"mentions":[],"urls":[]},{"text":"\"I lost 20 pounds...How? I drank bear piss and took up fencing. How the fuck you think, son? I exercised.\"","timestamp":1267900901,"mentions":[],"urls":[]},{"text":"\"I lost 20 pounds...How? I drank bear piss and took up fencing. How the fuck you think, son? I exercised.\"","timestamp":1267900901,"mentions":[],"urls":[]},{"text":"\"Science and Mother Nature are in a marriage where Science is always surprised to come home and find Mother Nature blowing the neighbor.\"","timestamp":1267392291,"mentions":[],"urls":[]},{"text":"\"A parent's only as good as their dumbest kid. If one wins a Nobel Prize but the other gets robbed by a hooker, you failed.\"","timestamp":1266879779,"mentions":[],"urls":[]},{"text":"\"There's a word for people like that...No, I'm saying, there's a word and I don't know what it is. I'm not being fucking poetic.\"","timestamp":1266522286,"mentions":[],"urls":[]},{"text":"\"Nah, we don't celebrate it. Don't know who St. Valentine was, don't give a shit, and doubt he wants people screwing in his memory.\"","timestamp":1266169215,"mentions":[],"urls":[]},{"text":"\"I don't get it; I sweat, I smell fine. You sweat, you smell like mule shit...Relax, she's on the treadmill next to you, she knows.\"","timestamp":1265747581,"mentions":[],"urls":[]},{"text":"\"Don't mess with him...Trust me, you don't fuck with a man that sleeps next to a woman he never screws. They're unpredictable.\"","timestamp":1265406971,"mentions":[],"urls":[]},{"text":"\"STOP apologizing. You're sorry, he gets it, Jesus. You spilled a glass of wine, not fucked his wife.\"","timestamp":1265045513,"mentions":[],"urls":[]},{"text":"“Calm down. You don’t just grab a ruler and tell everyone to whip their dicks out. You stuff your crotch and keep your pants on.”","timestamp":1264621182,"mentions":[],"urls":[]},{"text":"\"Sprain, huh? Did you go to medical school?... Well I did, so spare me your dog-shit diagnosis and lemme look at your ankle.\"","timestamp":1264278080,"mentions":[],"urls":[]},{"text":"\"No, I'm not a pessimist. At some point the world shits on everybody. Pretending it ain't shit makes you an idiot, not an optimist.\"","timestamp":1263924891,"mentions":[],"urls":[]},{"text":"\"Can we talk later? The news is on... Well, if you have tuberculosis it's not gonna get any worse in the next 30 minutes, jesus.\"","timestamp":1263579202,"mentions":[],"urls":[]},{"text":"\"Might not do a damn bit of good, but tell people to donate to Haiti on your twitter thing.\"  TEXT \"Haiti\" to 90999 to donate 10$","timestamp":1263494808,"mentions":[],"urls":[]},{"text":"\"No presents goddamit. I'm turning 74. I don't need you to commemorate that with a fucking Barnes and Noble gift card.\"","timestamp":1263249767,"mentions":[],"urls":[]},{"text":"\"Been thinking for a while, and I'd say there's 1.5 pounds of shit in the dog. Tried to get the vet to weigh a sack of it. No dice.\"","timestamp":1263067372,"mentions":[],"urls":[]},{"text":"\"I'm just gonna be me and they can go fuck themselves...Don't care, that's the only attitude you can have when you go to the DMV.\"","timestamp":1262721164,"mentions":[],"urls":[]},{"text":"\"Universe is 14 billion years old. Seems silly to celebrate one year. Be like having a fucking parade every time i take a piss.\"","timestamp":1262387452,"mentions":[],"urls":[]},{"text":"“Yes I got him a gift. He had a kidney stone. You piss a rock through your pecker, you deserve more than just a pat on the fucking back.\"","timestamp":1262024694,"mentions":[],"urls":[]},{"text":"\"You can watch the house while I'm gone. Just don't call me unless something's on fire, and don't screw in my bed.\"","timestamp":1261685466,"mentions":[],"urls":[]},{"text":"\"Fine, let’s take a vote.  Who wants fish for dinner?...Yeah, democracy ain’t so fun when it fucks you, huh?”","timestamp":1261339477,"mentions":[],"urls":[]},{"text":"\"Fine, let’s take a vote.  Who wants fish for dinner?...Yeah, democracy ain’t so fun when it fucks you, huh?”","timestamp":1261339477,"mentions":[],"urls":[]},{"text":"\"Mom is smarter than you...No? Well, ask yourself this; has mom ever unknowingly had toilet paper hanging out of her ass?...Mom 1. You 0\"","timestamp":1261077365,"mentions":[],"urls":[]},{"text":"\"I like See's candy. Put me in a See's store, I'm eating candy. The whole world is Tiger's See's store, and the candy is vagina.\"","timestamp":1260810898,"mentions":[],"urls":[]},{"text":"\"Pressure? Get married when you want. Your wedding's just one more day in my life I can't wear sweat pants.\"","timestamp":1260471515,"mentions":[],"urls":[]},{"text":"\"We're out of Grape Nuts... No, what's left is for me. Sorry, I should have said \"You're out of Grape Nuts.\"","timestamp":1260211754,"mentions":[],"urls":[]},{"text":"\"I just want silence. Jesus, it doesn't mean I don't like you. It just means right now, I like silence more.\"","timestamp":1259883030,"mentions":[],"urls":[]},{"text":"\"It's never the right time to have kids, but it's always the right time for screwing. God's not a dumbshit. He knows how it works.\"","timestamp":1259629158,"mentions":[],"urls":[]},{"text":"“The whole world is fueled by bullshit… What? The kid asked me for advice on his science fair project so I’m giving it to him.”","timestamp":1259357466,"mentions":[],"urls":[]},{"text":"\"Everybody's broke, so here's the rule for Christmas this year; if you still shit your pants, you get a present. Otherwise tough shit.\"","timestamp":1259090849,"mentions":[],"urls":[]},{"text":"“We’re banned from the dog park. Well, I guess it’s okay to hump, and it’s okay to bark, but both at the same time freaks people out.\"","timestamp":1258837677,"mentions":[],"urls":[]},{"text":"\"No. Tell 'em we're not doing Christmas dinner at a casino... Don't be an ass about it, but tell them why it's a fucking stupid idea.\"","timestamp":1258577940,"mentions":[],"urls":[]},{"text":"\"I don't need more friends. You got friends and all they do is ask you to help them move. Fuck that. I'm old. I'm through moving shit.\"","timestamp":1258398046,"mentions":[],"urls":[]},{"text":"\"A mule kicked Uncle Bob once. Broke his ribs. He punched it in the face.. My point? You have an ingrown fucking toenail. Stop bitching.\"","timestamp":1258140378,"mentions":[],"urls":[]},{"text":"\"Remember this: you're just a lucky fucking guy. If people start telling you your dick looks bigger, remember that it's not.\"","timestamp":1257880940,"mentions":[],"urls":[]},{"text":"\"You look just like Stephen Hawking...Relax, I meant like a non-paralyzed version of him. Feel better?... Fine. Forget I said it.\"","timestamp":1257802565,"mentions":[],"urls":[]},{"text":"\"Mom and I saw a great movie last night...No, don't remember the name. It was about a guy or, no, wait.. fuck, getting old sucks.\"","timestamp":1257625800,"mentions":[],"urls":[]},{"text":"\"Son, no one gives a shit about all the things your cell phone does. You didn't invent it, you just bought it. Anybody can do that.\"","timestamp":1257360056,"mentions":[],"urls":[]},{"text":"\"I hate paying bills... Son, don't say \"me too.\" I didn't say that looking to relate to you. I said it instead of \"go away.\"","timestamp":1257276455,"mentions":[],"urls":[]},{"text":"\"Oh please, you practically invented lazy. People should have to call you and ask for the rights to lazy before they use it.\"","timestamp":1257093895,"mentions":[],"urls":[]},{"text":"\"Nobody is that important. They eat, shit, and screw, just like you. Maybe not shit like you, you got those stomach problems.\"","timestamp":1256836286,"mentions":[],"urls":[]},{"text":"\"Nobody is that important. They eat, shit, and screw, just like you. Maybe not shit like you, you got those stomach problems.\"","timestamp":1256836286,"mentions":[],"urls":[]},{"text":"\"You worry too much. Eat some bacon... What? No, I got no idea if it'll make you feel better, I just made too much bacon.\"","timestamp":1256762349,"mentions":[],"urls":[]},{"text":"\"If mom calls, tell her I'm shitting... Son, marriage is about not having to lie about taking a shit.\"","timestamp":1256579170,"mentions":[],"urls":[]},{"text":"\"I need to change clothes? Wow. That's big talk coming from someone who looks like they robbed a Mervyn's.\"","timestamp":1256417009,"mentions":[],"urls":[]},{"text":"\"The baby will talk when he talks, relax. It ain't like he knows the cure for cancer and he just ain't spitting it out.\"","timestamp":1256230291,"mentions":[],"urls":[]},{"text":"\"You sure do like to tailgate people... Right, because it's real important you show up to the nothing you have to do on time.\"","timestamp":1256061234,"mentions":[],"urls":[]},{"text":"\"Just pay the parking ticket. Don't be so outraged. You're not a freedom fighter in the civil rights movement.  You double parked.\"","timestamp":1255895993,"mentions":[],"urls":[]},{"text":"\"I like the dog. If he can't eat it, or fuck it, he pisses on it. I can get behind that.\"","timestamp":1255713072,"mentions":[],"urls":[]},{"text":"\"Remember how you used to make fun of me for being bald?...No, I'm not gonna make a joke. I'll let your mirror do that.\"","timestamp":1255536950,"mentions":[],"urls":[]},{"text":"\"That woman was sexy...Out of your league? Son. Let women figure out why they won't screw you, don't do it for them.\"","timestamp":1255363803,"mentions":[],"urls":[]},{"text":"\"Son, people will always try and fuck you. Don't waste your life planning for a fucking, just be alert when your pants are down.\"","timestamp":1255196465,"mentions":[],"urls":[]},{"text":"\"I wanted to see Detroit win. I've been there. It's like God took a shit on a parking lot. They deserve some good news.\"","timestamp":1255018402,"mentions":[],"urls":[]},{"text":"\"We didn't have a prom. Dancing wasn't allowed...What's Footloose?...That's the plot of the movie? That sounds like a pile of shit.\"","timestamp":1254851834,"mentions":[],"urls":[]},{"text":"\"Does anyone your age know how to comb their fucking hair?  It looks like two squirrels crawled on their head and started fucking.\"","timestamp":1254762193,"mentions":[],"urls":[]},{"text":"\"You're being fucking dramatic. You own a TV and an air mattress. That's not exactly what I'd call \"a lot to lose.\"","timestamp":1254617823,"mentions":[],"urls":[]},{"text":"\"You're like a tornado of bullshit right now. We'll talk again after your bullshit dies out over someone else's house.\"","timestamp":1254442095,"mentions":[],"urls":[]},{"text":"\"Jesus Christ, Just give the dog his fucking food. Why's he gotta do a trick first? YOU don't have to do shit before YOU eat.\"","timestamp":1254331735,"mentions":[],"urls":[]},{"text":"\"It's not the gardener's job to pick up the dog shit. If you don't want to pick up the dog shit, then learn a skill like gardening.\"","timestamp":1254167237,"mentions":[],"urls":[]},{"text":"Do these announcers ever shut the fuck up? Don't ever say stuff just because you think you should. That's the definition of an asshole.\"","timestamp":1254077480,"mentions":[],"urls":[]},{"text":"\"A scar ain't 13 god damned stitches. I'll introduce you to men with REAL scars, then we'll all laugh at your fucking 13 stitches together.\"","timestamp":1253987853,"mentions":[],"urls":[]},{"text":"\"A scar ain't 13 god damned stitches. I'll introduce you to men with REAL scars, then we'll all laugh at your fucking 13 stitches together.\"","timestamp":1253987853,"mentions":[],"urls":[]},{"text":"\"I'm sitting in one of those TGI Friday's places, and everyone looks like they want to shove a shotgun in their mouth.\"","timestamp":1253829396,"mentions":[],"urls":[]},{"text":"\"You're gonna run into jerk offs. But remember, it's not the size of the asshole you worry about, it's how much shit comes out of it.\"","timestamp":1253727985,"mentions":[],"urls":[]},{"text":"\"I wouldn't worry about money...No, it has a lot to do with happiness, I just meant YOU shouldn't worry, cause you'd just piss it away.\"","timestamp":1253636916,"mentions":[],"urls":[]},{"text":"\"No, you can not borrow my t-shirt...How about instead of standing there looking shocked, you do your fucking laundry?\"","timestamp":1253572209,"mentions":[],"urls":[]},{"text":"I think the baby shit....Well, I'm smelling shit right now, so if it ain't the baby, one of you has a big fucking problem.\"","timestamp":1253473509,"mentions":[],"urls":[]},{"text":"\"Sometimes life leaves a hundred dollar bill on your dresser, and you don't realize until later that it's because it fucked you.\"","timestamp":1253381933,"mentions":[],"urls":[]},{"text":"\"The universe does not give a fuck about you. You are a speck in its shit.\"","timestamp":1253224806,"mentions":[],"urls":[]},{"text":"\"Fucking Radio Shack. It's a wonder they even know how to use a bathroom and don't just walk around all day with shit in their pants.\"","timestamp":1253128121,"mentions":[],"urls":[]},{"text":"\"Don't listen to the pussy side of you when you make a decision. People gravitate towards being a pussy. Remove the pussy, son.\"","timestamp":1253041062,"mentions":[],"urls":[]},{"text":"\"Happy birthday, I didn't get you a present...Oh, mom got you one? Well, that's from me then too, unless it's shitty.\"","timestamp":1252947137,"mentions":[],"urls":[]},{"text":"\"Anytime someone sells you food in a sack, it's not a sack of food, it's a sack of shit.\"","timestamp":1252866549,"mentions":[],"urls":[]},{"text":"\"I turn the kitchen faucet on and the shower burns you, yes, I get it...No, I'm not gonna stop, I'm just saying yes, I get that concept.\"","timestamp":1252684465,"mentions":[],"urls":[]},{"text":"\"Why the fuck would I want to live to 100? I'm 73 and shit's starting to get boring. By the way, there's no money left when I go, just fyi.\"","timestamp":1252619911,"mentions":[],"urls":[]},{"text":"'You don't know shit, and you're not shit. Don't take that the wrong way, that was meant to cheer you up.\"","timestamp":1252522892,"mentions":[],"urls":[]},{"text":"\"Here's a strawberry, sorry for farting near you...Hey! Either take the strawberry and stop bitching, or no strawberry, that's the deal.\"","timestamp":1252443851,"mentions":[],"urls":[]},{"text":"\"The worst thing you can be is a liar....Okay fine, yes, the worst thing you can be is a Nazi, but THEN, number two is liar. Nazi 1, Liar 2\"","timestamp":1252352475,"mentions":[],"urls":[]},{"text":"\"Who in the fuck is tila tequila? Is she a stripper?...That's her? Yeah, that's a stripper, son, I don't give a shit what you say.\"","timestamp":1252261346,"mentions":[],"urls":[]},{"text":"\"Everybody loves that Da Vinci code book.  Bullshit, it sucks. I read it. It's for all the dummies.\"","timestamp":1252178683,"mentions":[],"urls":[]},{"text":"\"I'm having a Makers Mark, you want one? What? 7up? I ain't mixing fucking makers with 7up. Might as well put a lil' fucking umbrella in it\"","timestamp":1252081701,"mentions":[],"urls":[]},{"text":"\"I'm having a Makers Mark, you want one? What? 7up? I ain't mixing fucking makers with 7up. Might as well put a lil' fucking umbrella in it\"","timestamp":1252081701,"mentions":[],"urls":[]},{"text":"“You touched that god damned biscuit. Bullshit, I saw you touch it….I don’t give a shit about your evidence, this isn’t a court of law.\"","timestamp":1252011679,"mentions":[],"urls":[]},{"text":"\"It's just a fucking june bug, calm down. Jesus Christ, what happens when something bigger than a testicle attacks you?\"","timestamp":1251922356,"mentions":[],"urls":[]},{"text":"\"What are you listening to?...I know who Hall & Oates are god dammit. It's the mustache guy and the gay man.\"","timestamp":1251828994,"mentions":[],"urls":[]},{"text":"\"I just did an hour on the gym machine. I'm sweaty and I have to shit. Where's my fannypack, this workout is over.\"","timestamp":1251740162,"mentions":[],"urls":[]},{"text":"to my bro-\"Your baby dropped his binky. The binky is on the table. THE BINKY IS ON THE TABLE. BINKY ON TABLE. PICK.UP.THE.BINKY. Thank you.\"","timestamp":1251693578,"mentions":[],"urls":[]},{"text":"(watching the Little League World Series) \"These kids are all fat. I remember when you were in little league.... You were fat.\"","timestamp":1251580022,"mentions":[],"urls":[]},{"text":"\"You know, sometimes it's nice having you around. But now ain't one of those times. Now gimmie the remote we're not watching this bullshit.\"","timestamp":1251483491,"mentions":[],"urls":[]},{"text":"\"Your mother rented this film, What Happens In Vegas. I thought it was going to be non-fiction, but it's fiction, and it's about some idiot.","timestamp":1251394704,"mentions":[],"urls":[]},{"text":"\"The dog don't like you planting stuff there. It's his backyard. If you're the only one who shits in something, you own it.  Remember that.\"","timestamp":1251304415,"mentions":[],"urls":[]},{"text":"\"How the fuck should I know if it's still good? Eat it. You get sick, it wasn't good. You people, you think I got microscopic fucking eyes.\"","timestamp":1251233701,"mentions":[],"urls":[]},{"text":"\"Who is this woman?....Kate Beckinsale?  Well, you can tell Kate Beckinsale she sucks.\"","timestamp":1251169664,"mentions":[],"urls":[]},{"text":"\"You need to flush the toilet more than once...No, YOU, YOU specifically need to. You know what, use a different toilet. This is my toilet.\"","timestamp":1251058037,"mentions":[],"urls":[]},{"text":"\"Don't touch the bacon, it's not done yet. You let me handle the bacon, and i'll let you handle..what ever it is you do. I guess nothing.\"","timestamp":1250964928,"mentions":[],"urls":[]},{"text":"\"Your mother made a batch of meatballs last night. Some are for you, some are for me, but more are for me. Remember that. More. Me.\"","timestamp":1250870235,"mentions":[],"urls":[]},{"text":"\"Your brother brought his baby over this morning.  He told me it could stand.  It couldn't stand for shit. Just sat there.  Big let down.\"","timestamp":1250786157,"mentions":[],"urls":[]},{"text":"\"Love this Mrs. Dash. The bitch can make spices... Jesus, Joni (my mom) it's a joke. I was making a joke! Mrs. Dash isn't even real dammit!\"","timestamp":1250699330,"mentions":[],"urls":[]},{"text":"\"The dog is not bored, it's a fucking dog. It's not like he's waiting for me to give him a fucking rubix cube.  He's a god damned dog.\"","timestamp":1250617406,"mentions":[],"urls":[]},{"text":"\"They serve Jim Beam on airplanes.  Tastes like piss.  You wouldn't be able to tell the difference, because you drink shit.  I don't.\"","timestamp":1250526205,"mentions":[],"urls":[]},{"text":"\"My flight lands at 9:30 on Sunday...You want to watch what?  What the fuck is mad men?  I'm a mad man if you don't pick me the hell up.\"","timestamp":1250372553,"mentions":[],"urls":[]},{"text":"\"My flight lands at 9:30 on Sunday...You want to watch what?  What the fuck is mad men?  I'm a mad man if you don't pick me the hell up.\"","timestamp":1250372553,"mentions":[],"urls":[]},{"text":"\"It's watering plants, Justin.  You just take a God damned hose and you put it over the plant.  You don't even pay rent, just do it.  Shit.\"","timestamp":1250268983,"mentions":[],"urls":[]},{"text":"(left on answering machine) \"Hello?  Hello?  It's Sam.  Anyone there?  Nobody checks this god damned thing. HELLO?! HELLO?!  Screw it.\"","timestamp":1250092015,"mentions":[],"urls":[]},{"text":"\"Tennessee is nice.  The first time I vomited was in tennessee, I think.\"","timestamp":1250011354,"mentions":[],"urls":[]},{"text":"If your brother comes by, tell him I'm on vacation.  I already told him that, but who knows with that guy.  Are you listening to me?  Fuck.","timestamp":1250009483,"mentions":[],"urls":[]},{"text":"Why would i want to check a voicemail on my cell phone?  People want to talk to me, call again.  If i want to talk to you, I'll answer.","timestamp":1249662821,"mentions":[],"urls":[]},{"text":"\"Jesus it's hot in here?  Right?  No?  It's fucking hot, you people looking at me like i'm crazy.  You're crazy.\"","timestamp":1249576918,"mentions":[],"urls":[]},{"text":"\"When I used to live in Los Angeles, I used to step in human feces a lot.\"","timestamp":1249488785,"mentions":[],"urls":[]},{"text":"\"The dog is an outside dog.  You want an inside dog, you go get your own inside.\"","timestamp":1249405198,"mentions":[],"urls":[]},{"text":"\"I didn't live to be 73 years old so I could eat kale.  Don't fix me your breakfast and pretend you're fixing mine.\"","timestamp":1249323858,"mentions":[],"urls":[]}]}